In [9]:
import pandas as pd

In [10]:
authors = pd.DataFrame({'author_id':[1,2,3], 'author_name':['Тургенев', 'Чехов', 'Островский']})

In [11]:
book = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3],
                     'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
                     'price':[450, 300, 350, 500, 450, 370, 290]})

In [12]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [13]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [14]:
#2

In [15]:
authors_price = pd.merge(authors, book, on='author_id')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [ ]:
#3

In [20]:
top5 = book.sort_values(by='price',ascending=False).head(5)
top5

   author_id         book_title  price
3          2   Толстый и тонкий    500
0          1        Отцы и дети    450
4          2    Дама с собачкой    450
5          3              Гроза    370
2          1  Дворянское гнездо    350

In [22]:
#4
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [91]:
authors_un = authors_price['author_name'].unique()

In [92]:
authors_un

array(['Тургенев', 'Чехов', 'Островский'], dtype=object)

In [93]:
authors_stat = pd.DataFrame({'author_name':authors_un,
    'max_price':authors_price.groupby('author_name')['price'].max(), 
    'min_price':authors_price.groupby('author_name')['price'].min(),
    'mean_price':authors_price.groupby('author_name')['price'].mean()})
authors_stat

            author_name  max_price  min_price  mean_price
author_name
Островский     Тургенев        370        290  330.000000
Тургенев          Чехов        450        300  366.666667
Чехов        Островский        500        450  475.000000

author_name
Островский    370
Тургенев      450
Чехов         500
Name: price, dtype: int64